[Killed] Negate expression
src/MutationTestingDemo/Services/DiscountService.cs:13:13
         decimal discountPercentage = 0m;
 
         // VIP: +15% sconto
-        if (customer.IsVip)
+        if (!(customer.IsVip))
         {
             discountPercentage += 0.15m;
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.LargeOrder_NonVip_ShouldGet5PercentDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.VipWithLargeOrder_ShouldGetCombinedDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_2YearsLoyalty_ShouldNotGetDiscount

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
src/MutationTestingDemo/Services/DiscountService.cs:15:13
         // VIP: +15% sconto
         if (customer.IsVip)
         {
-            discountPercentage += 0.15m;
+            discountPercentage -= 0.15m;
         }
 
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.VipWithLargeOrder_ShouldGetCombinedDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.Cap_AllDiscountsCombined_ShouldNotExceed25Percent; MutationTestingDemo.Tests.After.DiscountServiceTests.VipCustomer_ShouldGet15PercentDiscount

[Killed] Negate expression
src/MutationTestingDemo/Services/DiscountService.cs:19:13
         }
 
         // Ordine > 200 EUR: +5% sconto
-        if (subtotal > 200m)
+        if (!(subtotal > 200m))
         {
             discountPercentage += 0.05m;
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.LargeOrder_NonVip_ShouldGet5PercentDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.VipWithLargeOrder_ShouldGetCombinedDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_2YearsLoyalty_ShouldNotGetDiscount

[Killed] Equality mutation
src/MutationTestingDemo/Services/DiscountService.cs:19:13
         }
 
         // Ordine > 200 EUR: +5% sconto
-        if (subtotal > 200m)
+        if (subtotal >= 200m)
         {
             discountPercentage += 0.05m;
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_ExactlyAt200_ShouldNotGetOrderDiscount

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
src/MutationTestingDemo/Services/DiscountService.cs:21:13
         // Ordine > 200 EUR: +5% sconto
         if (subtotal > 200m)
         {
-            discountPercentage += 0.05m;
+            discountPercentage -= 0.05m;
         }
 
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.LargeOrder_NonVip_ShouldGet5PercentDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.VipWithLargeOrder_ShouldGetCombinedDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.Cap_AllDiscountsCombined_ShouldNotExceed25Percent

[Killed] Equality mutation
src/MutationTestingDemo/Services/DiscountService.cs:25:13
         }
 
         // Fedelta' >= 3 anni: +10% sconto
-        if (customer.LoyaltyYears >= 3)
+        if (customer.LoyaltyYears < 3)
         {
             discountPercentage += 0.10m;
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.LargeOrder_NonVip_ShouldGet5PercentDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.VipWithLargeOrder_ShouldGetCombinedDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_2YearsLoyalty_ShouldNotGetDiscount

[Killed] Equality mutation
src/MutationTestingDemo/Services/DiscountService.cs:25:13
         }
 
         // Fedelta' >= 3 anni: +10% sconto
-        if (customer.LoyaltyYears >= 3)
+        if (customer.LoyaltyYears > 3)
         {
             discountPercentage += 0.10m;
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_Exactly3YearsLoyalty_ShouldGetDiscount

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
src/MutationTestingDemo/Services/DiscountService.cs:27:13
         // Fedelta' >= 3 anni: +10% sconto
         if (customer.LoyaltyYears >= 3)
         {
-            discountPercentage += 0.10m;
+            discountPercentage -= 0.10m;
         }
 
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.Cap_AllDiscountsCombined_ShouldNotExceed25Percent; MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_Exactly3YearsLoyalty_ShouldGetDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.LoyalCustomer_ShouldGetLoyaltyDiscount

[Killed] Equality mutation
src/MutationTestingDemo/Services/DiscountService.cs:31:13
         }
 
         // Cap al 25%
-        if (discountPercentage > 0.25m)
+        if (discountPercentage < 0.25m)
         {
             discountPercentage = 0.25m;
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.LargeOrder_NonVip_ShouldGet5PercentDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.VipWithLargeOrder_ShouldGetCombinedDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_2YearsLoyalty_ShouldNotGetDiscount

[Killed] Negate expression
src/MutationTestingDemo/Services/DiscountService.cs:31:13
         }
 
         // Cap al 25%
-        if (discountPercentage > 0.25m)
+        if (!(discountPercentage > 0.25m))
         {
             discountPercentage = 0.25m;
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.LargeOrder_NonVip_ShouldGet5PercentDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.VipWithLargeOrder_ShouldGetCombinedDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_2YearsLoyalty_ShouldNotGetDiscount

[Killed] Block removal mutation
src/MutationTestingDemo/Services/DiscountService.cs:32:9
 
         // Cap al 25%
         if (discountPercentage > 0.25m)
-        {
-            discountPercentage = 0.25m;
-        }
+        {}
 
         return subtotal * discountPercentage;
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.Cap_AllDiscountsCombined_ShouldNotExceed25Percent

[Killed] Arithmetic mutation
src/MutationTestingDemo/Services/DiscountService.cs:36:16
             discountPercentage = 0.25m;
         }
 
-        return subtotal * discountPercentage;
+        return subtotal / discountPercentage;
     }
 }
killedBy: MutationTestingDemo.Tests.After.DiscountServiceTests.LargeOrder_NonVip_ShouldGet5PercentDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.VipWithLargeOrder_ShouldGetCombinedDiscount; MutationTestingDemo.Tests.After.DiscountServiceTests.Boundary_2YearsLoyalty_ShouldNotGetDiscount
