[Killed] Block removal mutation
src/MutationTestingDemo/Services/OrderService.cs:13:5
     private readonly IShippingService _shippingService;
 
     public OrderService(IDiscountService discountService, IShippingService shippingService)
-    {
-        _discountService = discountService;
-        _shippingService = shippingService;
-    }
+    {}
 
     public OrderResult ProcessOrder(Order order)
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.MultipleItems_ShouldSumCorrectly; MutationTestingDemo.Tests.After.OrderServiceTests.NonVipSmallOrder_ShouldHaveStandardShipping; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals

[Killed] Equality mutation
src/MutationTestingDemo/Services/OrderService.cs:20:13
 
     public OrderResult ProcessOrder(Order order)
     {
-        if (order.Items == null || order.Items.Count == 0)
+        if (order.Items != null || order.Items.Count == 0)
         {
             throw new InvalidOrderException("L'ordine deve contenere almeno un prodotto.");
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.MultipleItems_ShouldSumCorrectly; MutationTestingDemo.Tests.After.OrderServiceTests.NonVipSmallOrder_ShouldHaveStandardShipping; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals

[Killed] Negate expression
src/MutationTestingDemo/Services/OrderService.cs:20:13
 
     public OrderResult ProcessOrder(Order order)
     {
-        if (order.Items == null || order.Items.Count == 0)
+        if (!(order.Items == null || order.Items.Count == 0))
         {
             throw new InvalidOrderException("L'ordine deve contenere almeno un prodotto.");
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.MultipleItems_ShouldSumCorrectly; MutationTestingDemo.Tests.After.OrderServiceTests.NonVipSmallOrder_ShouldHaveStandardShipping; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals

[Killed] Statement mutation
src/MutationTestingDemo/Services/OrderService.cs:22:13
     {
         if (order.Items == null || order.Items.Count == 0)
         {
-            throw new InvalidOrderException("L'ordine deve contenere almeno un prodotto.");
+            ;
         }
 
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.NullItems_ShouldThrow; MutationTestingDemo.Tests.After.OrderServiceTests.EmptyOrder_ShouldThrowWithMessage

[Killed] String mutation
src/MutationTestingDemo/Services/OrderService.cs:22:45
     {
         if (order.Items == null || order.Items.Count == 0)
         {
-            throw new InvalidOrderException("L'ordine deve contenere almeno un prodotto.");
+            throw new InvalidOrderException("");
         }
 
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.EmptyOrder_ShouldThrowWithMessage

[Killed] Linq method mutation (Sum() to Max())
src/MutationTestingDemo/Services/OrderService.cs:26:28
         }
 
         // Calcola subtotale
-        decimal subtotal = order.Items.Sum(item => item.UnitPrice * item.Quantity);
+        decimal subtotal = order.Items.Max(item => item.UnitPrice * item.Quantity);
 
         // Applica sconto
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.MultipleItems_ShouldSumCorrectly; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals

[Killed] Arithmetic mutation
src/MutationTestingDemo/Services/OrderService.cs:26:52
         }
 
         // Calcola subtotale
-        decimal subtotal = order.Items.Sum(item => item.UnitPrice * item.Quantity);
+        decimal subtotal = order.Items.Sum(item => item.UnitPrice / item.Quantity);
 
         // Applica sconto
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.MultipleItems_ShouldSumCorrectly; MutationTestingDemo.Tests.After.OrderServiceTests.NonVipSmallOrder_ShouldHaveStandardShipping; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals

[Killed] Arithmetic mutation
src/MutationTestingDemo/Services/OrderService.cs:35:25
         var (shippingCost, shippingType) = _shippingService.CalculateShipping(order.Customer, subtotal);
 
         // Total = subtotale - sconto + spedizione
-        decimal total = subtotal - discountAmount + shippingCost;
+        decimal total = subtotal + discountAmount + shippingCost;
 
         // Conferma l'ordine se il totale e' valido
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals

[Killed] Arithmetic mutation
src/MutationTestingDemo/Services/OrderService.cs:35:25
         var (shippingCost, shippingType) = _shippingService.CalculateShipping(order.Customer, subtotal);
 
         // Total = subtotale - sconto + spedizione
-        decimal total = subtotal - discountAmount + shippingCost;
+        decimal total = subtotal - discountAmount - shippingCost;
 
         // Conferma l'ordine se il totale e' valido
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.NonVipSmallOrder_ShouldHaveStandardShipping; MutationTestingDemo.Tests.After.OrderServiceTests.MediumOrder_ShouldGetExpressShipping

[Killed] Equality mutation
src/MutationTestingDemo/Services/OrderService.cs:38:22
         decimal total = subtotal - discountAmount + shippingCost;
 
         // Conferma l'ordine se il totale e' valido
-        var status = total > 0 ? OrderStatus.Confirmed : OrderStatus.RequiresReview;
+        var status = total < 0 ? OrderStatus.Confirmed : OrderStatus.RequiresReview;
 
         return new OrderResult
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.NonVipSmallOrder_ShouldHaveStandardShipping; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals; MutationTestingDemo.Tests.After.OrderServiceTests.MediumOrder_ShouldGetExpressShipping

[Killed] Conditional (false) mutation
src/MutationTestingDemo/Services/OrderService.cs:38:22
         decimal total = subtotal - discountAmount + shippingCost;
 
         // Conferma l'ordine se il totale e' valido
-        var status = total > 0 ? OrderStatus.Confirmed : OrderStatus.RequiresReview;
+        var status = (false?OrderStatus.Confirmed :OrderStatus.RequiresReview);
 
         return new OrderResult
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.NonVipSmallOrder_ShouldHaveStandardShipping; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals; MutationTestingDemo.Tests.After.OrderServiceTests.MediumOrder_ShouldGetExpressShipping

[Killed] Object initializer mutation
src/MutationTestingDemo/Services/OrderService.cs:40:16
         // Conferma l'ordine se il totale e' valido
         var status = total > 0 ? OrderStatus.Confirmed : OrderStatus.RequiresReview;
 
-        return new OrderResult
-        {
-            Subtotal = subtotal,
-            DiscountAmount = discountAmount,
-            ShippingCost = shippingCost,
-            ShippingType = shippingType,
-            Total = total,
-            Status = status
-        };
+        return new OrderResult
+{};
     }
 }
killedBy: MutationTestingDemo.Tests.After.OrderServiceTests.MultipleItems_ShouldSumCorrectly; MutationTestingDemo.Tests.After.OrderServiceTests.NonVipSmallOrder_ShouldHaveStandardShipping; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals
