[Killed] Negate expression
src/MutationTestingDemo/Services/ShippingService.cs:11:13
     public (decimal Cost, ShippingType Type) CalculateShipping(Customer customer, decimal subtotal)
     {
         // VIP: spedizione gratuita
-        if (customer.IsVip)
+        if (!(customer.IsVip))
         {
             return (0m, ShippingType.Free);
killedBy: MutationTestingDemo.Tests.After.ShippingServiceTests.MediumOrder_Over100_ShouldGetExpress; MutationTestingDemo.Tests.After.ShippingServiceTests.SmallOrder_ShouldGetStandard; MutationTestingDemo.Tests.After.ShippingServiceTests.VipCustomer_ShouldGetFreeShipping

[Killed] Block removal mutation
src/MutationTestingDemo/Services/ShippingService.cs:12:9
     {
         // VIP: spedizione gratuita
         if (customer.IsVip)
-        {
-            return (0m, ShippingType.Free);
-        }
+        {}
 
         // Ordine > 500 EUR: gratuita
killedBy: MutationTestingDemo.Tests.After.ShippingServiceTests.VipCustomer_ShouldGetFreeShipping; MutationTestingDemo.Tests.After.OrderServiceTests.VipOrder_ShouldCalculateCorrectTotals

[Killed] Equality mutation
src/MutationTestingDemo/Services/ShippingService.cs:17:13
         }
 
         // Ordine > 500 EUR: gratuita
-        if (subtotal > 500m)
+        if (subtotal >= 500m)
         {
             return (0m, ShippingType.Free);
killedBy: MutationTestingDemo.Tests.After.ShippingServiceTests.Boundary_ExactlyAt500_ShouldNotGetFreeShipping

[Killed] Equality mutation
src/MutationTestingDemo/Services/ShippingService.cs:17:13
         }
 
         // Ordine > 500 EUR: gratuita
-        if (subtotal > 500m)
+        if (subtotal < 500m)
         {
             return (0m, ShippingType.Free);
killedBy: MutationTestingDemo.Tests.After.ShippingServiceTests.MediumOrder_Over100_ShouldGetExpress; MutationTestingDemo.Tests.After.ShippingServiceTests.SmallOrder_ShouldGetStandard; MutationTestingDemo.Tests.After.ShippingServiceTests.LargeOrder_Over500_ShouldGetFreeShipping

[Killed] Block removal mutation
src/MutationTestingDemo/Services/ShippingService.cs:18:9
 
         // Ordine > 500 EUR: gratuita
         if (subtotal > 500m)
-        {
-            return (0m, ShippingType.Free);
-        }
+        {}
 
         // Ordine > 100 EUR: Express (7.50 EUR)
killedBy: MutationTestingDemo.Tests.After.ShippingServiceTests.LargeOrder_Over500_ShouldGetFreeShipping

[Killed] Equality mutation
src/MutationTestingDemo/Services/ShippingService.cs:23:13
         }
 
         // Ordine > 100 EUR: Express (7.50 EUR)
-        if (subtotal > 100m)
+        if (subtotal < 100m)
         {
             return (7.50m, ShippingType.Express);
killedBy: MutationTestingDemo.Tests.After.ShippingServiceTests.MediumOrder_Over100_ShouldGetExpress; MutationTestingDemo.Tests.After.ShippingServiceTests.SmallOrder_ShouldGetStandard; MutationTestingDemo.Tests.After.ShippingServiceTests.Boundary_ExactlyAt500_ShouldNotGetFreeShipping

[Killed] Negate expression
src/MutationTestingDemo/Services/ShippingService.cs:23:13
         }
 
         // Ordine > 100 EUR: Express (7.50 EUR)
-        if (subtotal > 100m)
+        if (!(subtotal > 100m))
         {
             return (7.50m, ShippingType.Express);
killedBy: MutationTestingDemo.Tests.After.ShippingServiceTests.MediumOrder_Over100_ShouldGetExpress; MutationTestingDemo.Tests.After.ShippingServiceTests.SmallOrder_ShouldGetStandard; MutationTestingDemo.Tests.After.ShippingServiceTests.Boundary_ExactlyAt100_ShouldGetStandard

[Killed] Block removal mutation
src/MutationTestingDemo/Services/ShippingService.cs:24:9
 
         // Ordine > 100 EUR: Express (7.50 EUR)
         if (subtotal > 100m)
-        {
-            return (7.50m, ShippingType.Express);
-        }
+        {}
 
         // Default: Standard (5.00 EUR)
killedBy: MutationTestingDemo.Tests.After.ShippingServiceTests.MediumOrder_Over100_ShouldGetExpress; MutationTestingDemo.Tests.After.ShippingServiceTests.Boundary_ExactlyAt500_ShouldNotGetFreeShipping; MutationTestingDemo.Tests.After.OrderServiceTests.MediumOrder_ShouldGetExpressShipping
