[Killed] Equality mutation
src/MutationTestingDemo/Services/DiscountService.cs:19:13
         }
 
         // Ordine > 200 EUR: +5% sconto
-        if (subtotal > 200m)
+        if (subtotal < 200m)
         {
             discountPercentage += 0.05m;
killedBy: MutationTestingDemo.Tests.Before.OrderServiceTests.VipOrder_ShouldApplyDiscountAndFreeShipping; MutationTestingDemo.Tests.Before.OrderServiceTests.RegularCustomer_SmallOrder_ShouldHaveNoDiscount; MutationTestingDemo.Tests.Before.DiscountServiceTests.LoyalCustomer_ShouldGetLoyaltyDiscount

[Killed] Negate expression
src/MutationTestingDemo/Services/DiscountService.cs:25:13
         }
 
         // Fedelta' >= 3 anni: +10% sconto
-        if (customer.LoyaltyYears >= 3)
+        if (!(customer.LoyaltyYears >= 3))
         {
             discountPercentage += 0.10m;
killedBy: MutationTestingDemo.Tests.Before.OrderServiceTests.VipOrder_ShouldApplyDiscountAndFreeShipping; MutationTestingDemo.Tests.Before.OrderServiceTests.RegularCustomer_SmallOrder_ShouldHaveNoDiscount; MutationTestingDemo.Tests.Before.DiscountServiceTests.LoyalCustomer_ShouldGetLoyaltyDiscount
