[Survived] Conditional (true) mutation
src/MutationTestingDemo/Services/OrderService.cs:38:22
         decimal total = subtotal - discountAmount + shippingCost;
 
         // Conferma l'ordine se il totale e' valido
-        var status = total > 0 ? OrderStatus.Confirmed : OrderStatus.RequiresReview;
+        var status = (true?OrderStatus.Confirmed :OrderStatus.RequiresReview);
 
         return new OrderResult
