[Killed] Negate expression
src/MutationTestingDemo/Services/ShippingService.cs:17:13
         }
 
         // Ordine > 500 EUR: gratuita
-        if (subtotal > 500m)
+        if (!(subtotal > 500m))
         {
             return (0m, ShippingType.Free);
killedBy: MutationTestingDemo.Tests.Before.ShippingServiceTests.SmallOrder_ShouldGetStandardShipping; MutationTestingDemo.Tests.Before.ShippingServiceTests.LargeOrder_ShouldGetFreeShipping; MutationTestingDemo.Tests.Before.OrderServiceTests.RegularCustomer_SmallOrder_ShouldHaveNoDiscount
